### Terrafrom Plan Part # 3
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Apply 🤖`success`
  #### Terraform Destroy 🤖`success`

  <details><summary>Show Plan</summary>

  ```

  ct')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.tagging_policy_definitions.module.tagging_policy_definitions.azurerm_policy_definition.tagsWithValueRules will be created%0A  + resource "azurerm_policy_definition" "tagsWithValueRules" {%0A      + description         = "Enforces that the specified mandatory tags are not allowed specific values."%0A      + display_name        = "Mandatory tags with Value rules"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = <<-EOT%0A            {%0A                "category": "Tag Governance",%0A                "version" : "1.0.0"%0A                }%0A        EOT%0A      + mode                = "All"%0A      + name                = "tagsWithValueRules"%0A      + parameters          = jsonencode(%0A            {%0A              + ServiceName      = {%0A                  + defaultValue = "ServiceName"%0A                  + metadata     = {%0A                      + description = "Name of the mandatory tag ServiceName."%0A                      + displayName = "Mandatory tag ServiceName"%0A                    }%0A                  + type         = "String"%0A                }%0A              + effect           = {%0A                  + defaultValue = "Deny"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy."%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A              + notAllowedValues = {%0A                  + defaultValue = [%0A                      + "",%0A                      + "NA",%0A                      + "N/A",%0A                      + "tbc",%0A                      + "'tbc'",%0A                      + "TBC",%0A                      + "to_be_confirmed",%0A                      + "to be confirmed",%0A                    ]%0A                  + metadata     = {%0A                      + description = "A list of tag values that are not acceptable for tags"%0A                      + displayName = "Tag values not allowed for tags"%0A                    }%0A                  + type         = "Array"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + allOf = [%0A                      + {%0A                          + equals = "Microsoft.Resources/subscriptions/resourceGroups"%0A                          + field  = "type"%0A                        },%0A                      + {%0A                          + anyOf = [%0A                              + {%0A                                  + field = "[concat('tags[', parameters('ServiceName'), ']')]"%0A                                  + in    = "[parameters('notAllowedValues')]"%0A                                },%0A                            ]%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0APlan: 45 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_1["/providers/Microsoft.Management/managementGroups/mg_global"] will be created%0A  + resource "azurerm_management_group" "level_1" {%0A      + display_name               = "Global"%0A      + id                         = (known after apply)%0A      + name                       = "mg_global"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/6603f62a-2c40-4809-8acb-bd99553cc6ab"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "canary-Level 2A"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_2a"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2b"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "canary-Level 2B"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_2b"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2c"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "canary-Level 2C"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_2c"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2d"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "canary-Level 2D"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_2d"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2a"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "Level 2A"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_2a"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2b"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "Level 2B"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_2b"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2c"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "Level 2C"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_2c"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2d"] will be created%0A  + resource "azurerm_management_group" "level_2" {%0A      + display_name               = "Level 2D"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_2d"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/canary_mg_level_3a"] will be created%0A  + resource "azurerm_management_group" "level_3" {%0A      + display_name               = "canary-Level 3A"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_3a"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/canary_mg_level_3b"] will be created%0A  + resource "azurerm_management_group" "level_3" {%0A      + display_name               = "canary-Level 3B"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_3b"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/canary_mg_level_3c"] will be created%0A  + resource "azurerm_management_group" "level_3" {%0A      + display_name               = "canary-Level 3C"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_3c"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/mg_level_3a"] will be created%0A  + resource "azurerm_management_group" "level_3" {%0A      + display_name               = "Level 3A"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_3a"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_2a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/mg_level_3b"] will be created%0A  + resource "azurerm_management_group" "level_3" {%0A      + display_name               = "Level 3B"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_3b"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_2a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/mg_level_3c"] will be created%0A  + resource "azurerm_management_group" "level_3" {%0A      + display_name               = "Level 3C"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_3c"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_2a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/canary_mg_level_4a"] will be created%0A  + resource "azurerm_management_group" "level_4" {%0A      + display_name               = "canary-Level 4A"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_4a"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_3a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/canary_mg_level_4b"] will be created%0A  + resource "azurerm_management_group" "level_4" {%0A      + display_name               = "canary-Level 4B"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_4b"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_3a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/canary_mg_level_4c"] will be created%0A  + resource "azurerm_management_group" "level_4" {%0A      + display_name               = "canary-Level 4C"%0A      + id                         = (known after apply)%0A      + name                       = "canary_mg_level_4c"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_3b"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/mg_level_4a"] will be created%0A  + resource "azurerm_management_group" "level_4" {%0A      + display_name               = "Level 4A"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_4a"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_3a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/mg_level_4b"] will be created%0A  + resource "azurerm_management_group" "level_4" {%0A      + display_name               = "Level 4B"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_4b"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_3a"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/mg_level_4c"] will be created%0A  + resource "azurerm_management_group" "level_4" {%0A      + display_name               = "Level 4C"%0A      + id                         = (known after apply)%0A      + name                       = "mg_level_4c"%0A      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_3b"%0A      + subscription_ids           = (known after apply)%0A    }%0A%0A  # module.policy_assignments.module.policy_assignments.azurerm_management_group_policy_assignment.policy_assignment["nzism_built_in"] will be created%0A  + resource "azurerm_management_group_policy_assignment" "policy_assignment" {%0A      + description          = "Assignment of the built in NZISM initiative to management group"%0A      + display_name         = "nzism_built_in"%0A      + enforce              = true%0A      + id                   = (known after apply)%0A      + location             = "australiaeast"%0A      + management_group_id  = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata             = (known after apply)%0A      + name                 = "nzism_built_in"%0A      + not_scopes           = []%0A      + parameters           = jsonencode(%0A            {%0A              + effect-1e66c121-a66a-4b1f-9b83-0fd99bf0fc2d = {%0A                  + value = "Audit"%0A                }%0A            }%0A        )%0A      + policy_definition_id = "/providers/Microsoft.Authorization/policySetDefinitions/93d2179e-3068-c82f-2428-d614ae836a04"%0A%0A      + identity {%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "SystemAssigned"%0A        }%0A    }%0A%0A  # module.policy_assignments.module.policy_assignments.azurerm_management_group_policy_assignment.policy_assignment["tag_governance"] will be created%0A  + resource "azurerm_management_group_policy_assignment" "policy_assignment" {%0A      + description          = "Assignment of the custom tagging policies"%0A      + display_name         = "tag_governance"%0A      + enforce              = true%0A      + id                   = (known after apply)%0A      + location             = "australiaeast"%0A      + management_group_id  = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata             = (known after apply)%0A      + name                 = "tag_governance"%0A      + not_scopes           = []%0A      + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policySetDefinitions/tag_governance"%0A%0A      + identity {%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "SystemAssigned"%0A        }%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["compute/allowedLocationsForResources.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "Policy to deny upon creation of resources in non-approved regions."%0A      + display_name        = "Allowed locations for resources"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "All"%0A      + name                = "allowedLocationsForResources"%0A      + parameters          = jsonencode(%0A            {%0A              + allowedLocations = {%0A                  + defaultValue = [%0A                      + "australiaeast",%0A                      + "australiasoutheast",%0A                    ]%0A                  + metadata     = {%0A                      + description = "The location's that can be specified when deploying resources."%0A                      + displayName = "Allowed locations"%0A                      + strongType  = "location"%0A                    }%0A                  + type         = "array"%0A                }%0A              + effect           = {%0A                  + defaultValue = "Deny"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + allOf = [%0A                      + {%0A                          + field = "location"%0A                          + notIn = "[parameters('allowedLocations')]"%0A                        },%0A                      + {%0A                          + field     = "location"%0A                          + notEquals = "global"%0A                        },%0A                      + {%0A                          + field     = "type"%0A                          + notEquals = "Microsoft.AzureActiveDirectory/b2cDirectories"%0A                        },%0A                      + {%0A                          + exists = true%0A                          + field  = "location"%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["compute/auditKeyVaultAccessPolicies.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "Audit KeyVault Access Policies as RBAC Access Role should be used"%0A      + display_name        = "Audit KeyVault Access Policies"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "Indexed"%0A      + name                = "auditKeyVaultAccessPolicies"%0A      + parameters          = jsonencode(%0A            {%0A              + effect = {%0A                  + defaultValue = "Audit"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + allOf = [%0A                      + {%0A                          + equals = "Microsoft.KeyVault/vaults"%0A                          + field  = "type"%0A                        },%0A                      + {%0A                          + exists = "true"%0A                          + field  = "Microsoft.Keyvault/vaults/accessPolicies[*]"%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["compute/auditOldSQLVersion.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "Policy to generate an audit event upon creation of a sql server with version less than 12.0."%0A      + display_name        = "Audit Old SQL Version"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "All"%0A      + name                = "auditOldSQLVersion"%0A      + parameters          = jsonencode(%0A            {%0A              + effect = {%0A                  + defaultValue = "Audit"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + allOf = [%0A                      + {%0A                          + equals = "Microsoft.SQL/servers"%0A                          + field  = "type"%0A                        },%0A                      + {%0A                          + field = "Microsoft.SQL/servers/version"%0A                          + in    = [%0A                              + "2.0",%0A                              + "3.0",%0A                              + "4.0",%0A                              + "5.0",%0A                              + "6.0",%0A                              + "7.0",%0A                              + "8.0",%0A                              + "9.0",%0A                              + "10.0",%0A                              + "11.0",%0A                            ]%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["compute/auditResourceNoLock.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "Audit resource without DoNotDelete lock."%0A      + display_name        = "Audit resource without DoNotDelete lock"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "All"%0A      + name                = "auditResourceNoLock"%0A      + parameters          = jsonencode(%0A            {%0A              + effect = {%0A                  + defaultValue = "AuditIfNotExists"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + field = "type"%0A                  + like  = "*"%0A                }%0A              + then = {%0A                  + details = {%0A                      + existenceCondition = {%0A                          + field = "Microsoft.Authorization/locks/level"%0A                          + in    = [%0A                              + "CanNotDelete",%0A                            ]%0A                        }%0A                      + type               = "Microsoft.Authorization/locks"%0A                    }%0A                  + effect  = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["compute/auditSQLBasicCreate.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "Policy to generate an audit event upon creation of a SQL database with 'Basic' edition type."%0A      + display_name        = "Audit SQL Basic SKU"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "All"%0A      + name                = "auditSQLBasicCreate"%0A      + parameters          = jsonencode(%0A            {%0A              + effect = {%0A                  + defaultValue = "Audit"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + equals = "Basic"%0A                  + field  = "Microsoft.SQL/servers/databases/edition"%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["compute/denyClassicResourceCreate.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "Policy to deny upon creation of classic/v1 (i.e., ASM-based) resources."%0A      + display_name        = "Deny Classic Resource"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "All"%0A      + name                = "denyClassicResourceCreate"%0A      + parameters          = jsonencode(%0A            {%0A              + effect = {%0A                  + defaultValue = "Deny"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + anyOf = [%0A                      + {%0A                          + field = "type"%0A                          + like  = "Microsoft.ClassicCompute/*"%0A                        },%0A                      + {%0A                          + field = "type"%0A                          + like  = "microsoft.classicStorage/*"%0A                        },%0A                      + {%0A                          + field = "type"%0A                          + like  = "Microsoft.ClassicNetwork/*"%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["compute/denyStandardTierKeyVault.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "Policy to deny upon creation of standard keyvault resources"%0A      + display_name        = "Deny Standard Tier KeyVault"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "All"%0A      + name                = "denyStandardTierKeyVault"%0A      + parameters          = jsonencode(%0A            {%0A              + effect = {%0A                  + defaultValue = "Deny"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + allOf = [%0A                      + {%0A                          + equals = "Microsoft.KeyVault/vaults"%0A                          + field  = "type"%0A                        },%0A                      + {%0A                          + not = {%0A                              + equals = "recover"%0A                              + field  = "Microsoft.KeyVault/vaults/createMode"%0A                            }%0A                        },%0A                      + {%0A                          + not = {%0A                              + equals = "premium"%0A                              + field  = "Microsoft.KeyVault/vaults/sku.name"%0A                            }%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_definitions.module.policy_definitions.azurerm_policy_definition.policy_definitions["security/deny_vnet_peering.json"] will be created%0A  + resource "azurerm_policy_definition" "policy_definitions" {%0A      + description         = "This policy denies the creation of vNet Peerings under the assigned scope."%0A      + display_name        = "Deny VNet Peering"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Network"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + mode                = "All"%0A      + name                = "deny_vnet_peering"%0A      + parameters          = jsonencode(%0A            {%0A              + effect = {%0A                  + defaultValue = "Deny"%0A                  + metadata     = {%0A                      + description = "Enable or disable the execution of the policy"%0A                      + displayName = "Effect"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + equals = "Microsoft.Network/virtualNetworks/virtualNetworkPeerings"%0A                  + field  = "type"%0A                }%0A              + then = {%0A                  + effect = "[parameters('effect')]"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.policy_set_def.module.policy_set_def.azurerm_policy_set_definition.policy_set_definitions["compute/compute.json"] will be created%0A  + resource "azurerm_policy_set_definition" "policy_set_definitions" {%0A      + description         = "Contains common Compute Governance policies"%0A      + display_name        = "Compute"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Compute"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + name                = "compute"%0A      + parameters          = jsonencode(%0A            {%0A              + allowedLocations    = {%0A                  + defaultValue = [%0A                      + "australiaeast",%0A                      + "australiasoutheast",%0A                    ]%0A                  + metadata     = {%0A                      + description = "The list of locations that resource groups can be created in."%0A                      + displayName = "Allowed locations"%0A                      + strongType  = "location"%0A                    }%0A                  + type         = "Array"%0A                }%0A              + ddosPlan            = {%0A                  + defaultValue = ""%0A                  + metadata     = {%0A                      + description = "DDoS Protection Plan resource to be associated to the virtual networks"%0A                      + displayName = "DDoS Protection Plan"%0A                      + strongType  = "Microsoft.Network/ddosProtectionPlans"%0A                    }%0A                  + type         = "String"%0A                }%0A              + listOfAllowedVMSKUs = {%0A                  + defaultValue = [%0A                      + "standard_b2s",%0A                      + "standard_b1s",%0A                      + "standard_d2",%0A                      + "standard_d2_v2",%0A                      + "standard_ds1_v2",%0A                      + "standard_ds2_v2",%0A                      + "standard_ds3_v2",%0A                      + "standard_ds4_v2",%0A                    ]%0A                  + metadata     = {%0A                      + description = "The list of size SKUs that can be specified for virtual machines."%0A                      + displayName = "Allowed VM Size SKUs"%0A                      + strongType  = "VMSKUs"%0A                    }%0A                  + type         = "Array"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + ddosPlan = {%0A                      + value = "[parameters('ddosPlan')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/94de2ad3-e0c1-4caf-ad78-5d47bbc83d3d"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + listOfAllowedLocations = {%0A                      + value = "[parameters('allowedLocations')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/e765b5de-1225-4ba3-bd56-1ac6695af988"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + listOfAllowedSKUs = {%0A                      + value = "[parameters('listOfAllowedVMSKUs')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/cccc23c7-8427-4f53-ad12-b6a63eb452b3"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/auditOldSQLVersion"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/auditSQLBasicCreate"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/denyClassicResourceCreate"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/auditResourceNoLock"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/allowedLocationsForResources"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/denyStandardTierKeyVault"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/auditKeyVaultAccessPolicies"%0A          + reference_id         = (known after apply)%0A        }%0A    }%0A%0A  # module.policy_set_def.module.policy_set_def.azurerm_policy_set_definition.policy_set_definitions["data_governance/data_governance.json"] will be created%0A  + resource "azurerm_policy_set_definition" "policy_set_definitions" {%0A      + description         = "Contains common Data Protection Governance policies"%0A      + display_name        = "Data Protection Governance"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Data Protection Governance"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + name                = "data_protection_governance"%0A      + policy_type         = "Custom"%0A%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/d38fc420-0735-4ef3-ac11-c806f651a570"%0A          + reference_id         = (known after apply)%0A        }%0A    }%0A%0A  # module.policy_set_def.module.policy_set_def.azurerm_policy_set_definition.policy_set_definitions["monitoring/monitoring.json"] will be created%0A  + resource "azurerm_policy_set_definition" "policy_set_definitions" {%0A      + description         = "Contains common Monitoring policies"%0A      + display_name        = "Monitoring"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Monitoring"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + name                = "monitoring"%0A      + parameters          = jsonencode(%0A            {%0A              + logAnalytics = {%0A                  + metadata = {%0A                      + assignPermissions = true%0A                      + description       = "Specify the Log Analytics workspace the agent should be connected to. If this workspace is outside of the scope of the assignment you must manually grant 'Log Analytics Contributor' permissions (or similar) to the policy assignment's principal ID."%0A                      + displayName       = "Log Analytics workspace"%0A                      + strongType        = "omsWorkspace"%0A                    }%0A                  + type     = "String"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/11ac78e3-31bc-4f0c-8434-37ab963cea07"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/32133ab0-ee4b-4b44-98d6-042180979d50"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + logAnalytics = {%0A                      + value = "[parameters('logAnalytics')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/69af7d4a-7b18-4044-93a9-2651498ef203"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + logAnalytics = {%0A                      + value = "[parameters('logAnalytics')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/0868462e-646c-4fe3-9ced-a733534b6a2c"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + logAnalytics = {%0A                      + value = "[parameters('logAnalytics')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/053d3325-282c-4e5c-b944-24faffd30d77"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/91cb9edd-cd92-4d2f-b2f2-bdd8d065a3d4"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/1c210e94-a481-4beb-95fa-1571b434fb04"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/deacecc0-9f84-44d2-bb82-46f32d766d43"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/4da21710-ce6f-4e06-8cdb-5cc4c93ffbee"%0A          + reference_id         = (known after apply)%0A        }%0A    }%0A%0A  # module.policy_set_def.module.policy_set_def.azurerm_policy_set_definition.policy_set_definitions["networking/networking-connectivity.json"] will be created%0A  + resource "azurerm_policy_set_definition" "policy_set_definitions" {%0A      + description         = "Contains networking policies"%0A      + display_name        = "Networking - Connectivity"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Networking"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + name                = "networking-connectivity"%0A      + parameters          = jsonencode(%0A            {%0A              + ddosPlan = {%0A                  + defaultValue = ""%0A                  + metadata     = {%0A                      + description = "DDoS Protection Plan resource to be associated to the virtual networks"%0A                      + displayName = "DDoS Protection Plan"%0A                      + strongType  = "Microsoft.Network/ddosProtectionPlans"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + ddosPlan = {%0A                      + value = "[parameters('ddosPlan')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/94de2ad3-e0c1-4caf-ad78-5d47bbc83d3d"%0A          + reference_id         = (known after apply)%0A        }%0A    }%0A%0A  # module.policy_set_def.module.policy_set_def.azurerm_policy_set_definition.policy_set_definitions["networking/networking_landing_zone.json"] will be created%0A  + resource "azurerm_policy_set_definition" "policy_set_definitions" {%0A      + description         = "Contains networking policies for the Application Landing Zone"%0A      + display_name        = "Networking - Landing Zone"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Networking"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + name                = "networking_landing_zone"%0A      + parameters          = jsonencode(%0A            {%0A              + ddosPlan = {%0A                  + metadata = {%0A                      + description = "DDoS Protection Plan resource to be associated to the virtual networks"%0A                      + displayName = "DDoS Protection Plan"%0A                      + strongType  = "Microsoft.Network/ddosProtectionPlans"%0A                    }%0A                  + type     = "String"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A%0A      + policy_definition_reference {%0A          + parameter_values     = jsonencode(%0A                {%0A                  + ddosPlan = {%0A                      + value = "[parameters('ddosPlan')]"%0A                    }%0A                }%0A            )%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/94de2ad3-e0c1-4caf-ad78-5d47bbc83d3d"%0A          + reference_id         = (known after apply)%0A        }%0A    }%0A%0A  # module.policy_set_def.module.policy_set_def.azurerm_policy_set_definition.policy_set_definitions["security/security_landing_zone.json"] will be created%0A  + resource "azurerm_policy_set_definition" "policy_set_definitions" {%0A      + description         = "Contains Security policies for Application Landing Zone"%0A      + display_name        = "Security - Landing Zone"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Security"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + name                = "security_landing_zone"%0A      + policy_type         = "Custom"%0A%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/deny_vnet_peering"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/425bea59-a659-4cbb-8d31-34499bd030b8"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/fc5e4038-4584-4632-8c85-c0448d374b2c"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/83a86a26-fd1f-447c-b59d-e51f44264114"%0A          + reference_id         = (known after apply)%0A        }%0A    }%0A%0A  # module.policy_set_def.module.policy_set_def.azurerm_policy_set_definition.policy_set_definitions["tag_governance/tag_governance.json"] will be created%0A  + resource "azurerm_policy_set_definition" "policy_set_definitions" {%0A      + description         = "Contains tag governance policies"%0A      + display_name        = "Tag Governance"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = jsonencode(%0A            {%0A              + category = "Tag Governance"%0A              + version  = "1.0.0"%0A            }%0A        )%0A      + name                = "tag_governance"%0A      + policy_type         = "Custom"%0A%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/requireTagsOnRG"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/inheritTagsFromRG"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/inheritTagValuesFromRG"%0A          + reference_id         = (known after apply)%0A        }%0A      + policy_definition_reference {%0A          + policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policyDefinitions/TagsWithValueRules"%0A          + reference_id         = (known after apply)%0A        }%0A    }%0A%0A  # module.resource_groups.module.resource_groups.azurerm_resource_group.resource_groups["TestRG"] will be created%0A  + resource "azurerm_resource_group" "resource_groups" {%0A      + id       = (known after apply)%0A      + location = "australiaeast"%0A      + name     = "TestRG"%0A      + tags     = {%0A          + "Environment" = "DEV"%0A          + "ServiceName" = "TerrAHCOF"%0A        }%0A    }%0A%0A  # module.resource_groups.module.resource_groups.azurerm_storage_container.storage_container["TerrAHCOF"] will be created%0A  + resource "azurerm_storage_container" "storage_container" {%0A      + container_access_type   = "private"%0A      + has_immutability_policy = (known after apply)%0A      + has_legal_hold          = (known after apply)%0A      + id                      = (known after apply)%0A      + metadata                = (known after apply)%0A      + name                    = "terrahcoftfstate"%0A      + resource_manager_id     = (known after apply)%0A      + storage_account_name    = "stterrahcofstateae"%0A    }%0A%0A  # module.state_file_management.module.state_file_management.azurerm_storage_account.state_file_storage_accounts["BAU"] will be created%0A  + resource "azurerm_storage_account" "state_file_storage_accounts" {%0A      + access_tier                       = (known after apply)%0A      + account_kind                      = "StorageV2"%0A      + account_replication_type          = "GRS"%0A      + account_tier                      = "Standard"%0A      + allow_nested_items_to_be_public   = true%0A      + cross_tenant_replication_enabled  = true%0A      + default_to_oauth_authentication   = false%0A      + enable_https_traffic_only         = true%0A      + id                                = (known after apply)%0A      + infrastructure_encryption_enabled = false%0A      + is_hns_enabled                    = false%0A      + large_file_share_enabled          = (known after apply)%0A      + location                          = "australiaeast"%0A      + min_tls_version                   = "TLS1_2"%0A      + name                              = "stbaubauaedev"%0A      + nfsv3_enabled                     = false%0A      + primary_access_key                = (sensitive value)%0A      + primary_blob_connection_string    = (sensitive value)%0A      + primary_blob_endpoint             = (known after apply)%0A      + primary_blob_host                 = (known after apply)%0A      + primary_connection_string         = (sensitive value)%0A      + primary_dfs_endpoint              = (known after apply)%0A      + primary_dfs_host                  = (known after apply)%0A      + primary_file_endpoint             = (known after apply)%0A      + primary_file_host                 = (known after apply)%0A      + primary_location                  = (known after apply)%0A      + primary_queue_endpoint            = (known after apply)%0A      + primary_queue_host                = (known after apply)%0A      + primary_table_endpoint            = (known after apply)%0A      + primary_table_host                = (known after apply)%0A      + primary_web_endpoint              = (known after apply)%0A      + primary_web_host                  = (known after apply)%0A      + public_network_access_enabled     = true%0A      + queue_encryption_key_type         = "Service"%0A      + resource_group_name               = "rg-terrahcof-state-ae"%0A      + secondary_access_key              = (sensitive value)%0A      + secondary_blob_connection_string  = (sensitive value)%0A      + secondary_blob_endpoint           = (known after apply)%0A      + secondary_blob_host               = (known after apply)%0A      + secondary_connection_string       = (sensitive value)%0A      + secondary_dfs_endpoint            = (known after apply)%0A      + secondary_dfs_host                = (known after apply)%0A      + secondary_file_endpoint           = (known after apply)%0A      + secondary_file_host               = (known after apply)%0A      + secondary_location                = (known after apply)%0A      + secondary_queue_endpoint          = (known after apply)%0A      + secondary_queue_host              = (known after apply)%0A      + secondary_table_endpoint          = (known after apply)%0A      + secondary_table_host              = (known after apply)%0A      + secondary_web_endpoint            = (known after apply)%0A      + secondary_web_host                = (known after apply)%0A      + sftp_enabled                      = false%0A      + shared_access_key_enabled         = true%0A      + table_encryption_key_type         = "Service"%0A%0A      + identity {%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "SystemAssigned"%0A        }%0A    }%0A%0A  # module.tagging_policy_definitions.module.tagging_policy_definitions.azurerm_policy_definition.inheritTagValuesFromRG will be created%0A  + resource "azurerm_policy_definition" "inheritTagValuesFromRG" {%0A      + description         = "Adds the mandatory tags with its value from the parent resource group when any resource missing this tag is created or updated. Existing resources can be remediated by triggering a remediation task. If the tags exists with a different value it will not be changed."%0A      + display_name        = "Inherit tag values from the resource group"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = <<-EOT%0A            {%0A                "category": "Tag Governance",%0A                "version" : "1.0.0"%0A                }%0A        EOT%0A      + mode                = "Indexed"%0A      + name                = "inheritTagValuesFromRG"%0A      + parameters          = jsonencode(%0A            {%0A              + Environment = {%0A                  + defaultValue = "Environment"%0A                  + metadata     = {%0A                      + description = "Name of the mandatory tag Environment."%0A                      + displayName = "Require tag Environment on a resource groups"%0A                    }%0A                  + type         = "String"%0A                }%0A              + ServiceName = {%0A                  + defaultValue = "ServiceName"%0A                  + metadata     = {%0A                      + description = "Name of the mandatory tag ServiceName."%0A                      + displayName = "Require tag ServiceName on a resource groups"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + anyOf = [%0A                      + {%0A                          + notEquals = ""%0A                          + value     = "[resourceGroup().tags[parameters('ServiceName')]]"%0A                        },%0A                      + {%0A                          + notEquals = ""%0A                          + value     = "[resourceGroup().tags[parameters('Environment')]]"%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + details = {%0A                      + operations        = [%0A                          + {%0A                              + field     = "[concat('tags[', parameters('ServiceName'), ']')]"%0A                              + operation = "add"%0A                              + value     = "[resourceGroup().tags[parameters('ServiceName')]]"%0A                            },%0A                          + {%0A                              + field     = "[concat('tags[', parameters('Environment'), ']')]"%0A                              + operation = "add"%0A                              + value     = "[resourceGroup().tags[parameters('Environment')]]"%0A                            },%0A                        ]%0A                      + roleDefinitionIds = [%0A                          + "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c",%0A                        ]%0A                    }%0A                  + effect  = "modify"%0A                }%0A            }%0A        )%0A      + policy_type         = "Custom"%0A      + role_definition_ids = (known after apply)%0A    }%0A%0A  # module.tagging_policy_definitions.module.tagging_policy_definitions.azurerm_policy_definition.inheritTagsFromRG will be created%0A  + resource "azurerm_policy_definition" "inheritTagsFromRG" {%0A      + description         = "Adds the mandatory tags from the parent resource group when any resource missing this tag is created or updated. Existing resources can be remediated by triggering a remediation task. If the tags exists with a different value it will not be changed."%0A      + display_name        = "Inherit tags from the resource group"%0A      + id                  = (known after apply)%0A      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"%0A      + metadata            = <<-EOT%0A            {%0A                "category": "Tag Governance",%0A                "version" : "1.0.0"%0A                }%0A        EOT%0A      + mode                = "Indexed"%0A      + name                = "inheritTagsFromRG"%0A      + parameters          = jsonencode(%0A            {%0A              + Environment = {%0A                  + defaultValue = "Environment"%0A                  + metadata     = {%0A                      + description = "Name of the mandatory tag Environment."%0A                      + displayName = "Require tag Environment on a resource groups"%0A                    }%0A                  + type         = "String"%0A                }%0A              + ServiceName = {%0A                  + defaultValue = "ServiceName"%0A                  + metadata     = {%0A                      + description = "Name of the mandatory tag ServiceName."%0A                      + displayName = "Require tag ServiceName on a resource groups"%0A                    }%0A                  + type         = "String"%0A                }%0A            }%0A        )%0A      + policy_rule         = jsonencode(%0A            {%0A              + if   = {%0A                  + anyOf = [%0A                      + {%0A                          + exists = "false"%0A                          + field  = "[concat('tags[', parameters('ServiceName'), ']')]"%0A                        },%0A                      + {%0A                          + exists = "false"%0A                          + field  = "[concat('tags[', parameters('Environment'), ']')]"%0A                        },%0A                    ]%0A                }%0A              + then = {%0A                  + details = {%0A                      + operations        = [%0A                          + {%0A                              + field     = "[concat('tags[', parameters('ServiceName'), ']')]"%0A                              + operation = "add"%0A                              + value     = "[resourceGroup().tags[parameters('ServiceName')]]"%0A                            },%0A                          + {%0A                              + field     = "[concat('tags[', parameters('Environment'), ']')]"%0A                              + operation = "add"%0A                              + value     = "[resourceGroup().tags[parameters('Environment')]]"%0A                            },%0A                        ]%0A                      + roleDefinitionIds = [%0A                          + "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c",%0A                        ]%0A                    }%0A            
  ```

  </details>

  *Pushed by: @toshmackevics, Action: `pull_request`*